# GetPipeFittingAndAccessoryData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIDataItem..::..GetPipeFittingAndAccessoryData Method
PipeFittingAndAccessoryPressureDropUIDataItem Class See Also
---
Gets the fitting data stored in the UI data item.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
```

Visual Basic
---
```text
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
```

Visual C++
---
```text
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
```

# ### Return Value
The fitting data stored in the UI data item.
# See Also
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace